{"id":1891,"date":"2020-01-18T03:48:04","date_gmt":"2020-01-18T03:48:04","guid":{"rendered":"https:\/\/minglecity.com\/?page_id=1891"},"modified":"2020-01-18T03:48:04","modified_gmt":"2020-01-18T03:48:04","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/minglecity.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Privacy Policy and Protection of Personal Information<\/h2>\n\n\n\n<p>This site is owned by Mingle City LLC (“MINGLECITY”) and\/or its subsidiaries.&nbsp; MINGLECITY’s privacy policy covers the collection, use and dissemination of personal information that may be collected by MINGLECITY anytime you interact with MINGLECITY on one of its websites, such as when you listen to audio streams, view video streams, visit our websites, when you purchase products, or when you contact MINGLECITY.&nbsp; Please take a moment to read the following to learn more about our information practices, including what type of information is gathered, how the information is used and for what purposes, to whom we disclose the information, and how we safeguard your personal information.&nbsp;By using MINGLECITY’s sites you agree to the terms of the Privacy Policy.<\/p>\n\n\n\n<p><strong>Why we collect information.<\/strong><br>MINGLECITY collects information to assist us in delivering a superior level of product.&nbsp; We collect information to gain a better understanding of our customers and their needs and thus provide more valuable services.&nbsp; This helps us to determine how best to provide useful information to customers and to understand which parts of our websites and Internet services are of most interest to them.<\/p>\n\n\n\n<p>It enables us to give you convenient access to our products and services and focus on categories of greatest interest to you.&nbsp; In addition, your personal information helps us keep you posted on the latest product announcements, updates, special offers, promotions, and events that you might like to hear about.<\/p>\n\n\n\n<p><strong>What information we collect.<\/strong><br>The information we learn from customers helps us personalize and continually improve your experience with our products and services.&nbsp; Here are the types of information we gather.<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li><strong>Automatic Information:<br><\/strong>Our servers automatically collect certain non-personally identifying information, such as your computer’s IP address, the type of browser in use, and pages viewed, streams viewed or listened to and when you visit our Sites. We use this information to understand how visitors navigate through our Sites and use our products, to enhance your experience while using our Sites, and to make the materials we post as valuable to visitors as possible. We do not link this information to personally identifiable information.<\/li><li><strong>Information You Give Us:<br><\/strong>We receive and store any information you enter during account creation or any information you voluntarily provide us in any other way. You can choose not to provide certain personally identifiable information, but then you might not be able to take advantage of many of our features.&nbsp; We use the personally identifiable information that you provide to us for such purposes as responding to your requests, customizing your experience, improving our product, and communicating with you.<\/li><\/ul>\n\n\n\n<p><strong>How we use the information collected.<\/strong><br>There are a number of situations in which your personal information may help us give you better service.<br>It helps us gain a better understanding of how our products are used, including Web traffic patterns and what types of content are most popular with users of our products and services.<\/p>\n\n\n\n<p>This information is also used to improve our software and services by providing personalized content recommendations, location customization, and\/or personalized help and instructions.<\/p>\n\n\n\n<p>We track content accesses and downloads&nbsp;for the purpose of paying royalties and license fees to third party providers, such as record labels, advertisers and other copyright holders and content distributors.<\/p>\n\n\n\n<p>When you create an account — providing your name, email address, zip code or other information — and choose a password and password hint (such as the month and day of your birth) for security. The system saves your information and assigns you a personal ID — in many cases simply your email address, because it is unique and easy to remember. You have the option for streaming services to “remember” you, and your favorites or other preferences you have set will be available automatically, and on occasion greet you by first name. Some of this information may, on occasion, be transferred to 3rd parties to automatically fill in relevant form fields and simplify the process.&nbsp; This information is not stored on the 3rd party website until you submit the form.&nbsp; However, once the form is submitted, then this personally identifiable information may be stored on the 3rd party website.<\/p>\n\n\n\n<p>If you use a means of public communication, you should be aware that any information you share is visible to other users. Personally identifiable information you post as a message to one of these forums can be read, collected, or used by other individuals to send you unsolicited messages. MINGLECITY is not responsible for the personally identifiable information you choose to submit in these forums.<\/p>\n\n\n\n<p><strong>Technologies used to collect information.<\/strong><br>As is standard practice on many corporate websites, MINGLECITY’s website uses “cookies” and other technologies to help us understand which parts of our websites are the most popular, where our visitors are going, and how much time they spend there. We also use cookies and other technologies to make sure that our online advertising is bringing customers to our products and services. We use cookies and other technologies to study traffic patterns on our website, to make it even more rewarding as well as to study the effectiveness of our customer communications. And we use cookies to customize your experience and provide greater convenience each time you interact with us. For example, knowing your first name lets us welcome you with a greeting the next time you use our products.<\/p>\n\n\n\n<p>Our advertisers help us deliver a number of useful services which are free of charge to you. Our advertisers will often employ the use of a “click-through URL” linked to content on their website. When a customer clicks one of these URLs, they pass through a web server before arriving at the destination web page. They track this click-through data to help determine general interest and measure the effectiveness of customer communications.<\/p>\n\n\n\n<p><strong>Intended Audience<br><\/strong>Products and services on all MINGLECITY websites are intended for United States Audiences over the age of 13.&nbsp; All of our services are operated in accordance with the laws of the United States.&nbsp; We make no representation that any service offered by MINGLECITY is operated in accordance with the laws or governed by other nations.&nbsp; Please be aware that any personal information you transfer to us will be transferred to the U.S and is subject to U.S. law.&nbsp; We will reject or delete any personally identifiable information that we believe in good faith to be inconsistent with this Privacy Policy.<\/p>\n\n\n\n<p><strong>Children’s Privacy Policy<br><\/strong>Although persons of all ages may visit our websites and participate in activities that do not require the collection of personal information, we do not knowingly or intentionally collect personal information from children under the age of 13.&nbsp; Except for the limited circumstances listed below, we will automatically reject and delete the registration or entry of any person we believe in good faith to be underage.&nbsp; Any false or fraudulent registration or entry from a minor will be deemed to be ineligible and will disqualify the minor from the receipt of a prize, benefit, or other participation.<\/p>\n\n\n\n<p>Except to meet Federal Communications Commission (“FCC”) regulations, as required by applicable laws, or other regulatory and legal purposes, we will not use, store, or disclose any child’s personal information to a third party without prior parental consent.<\/p>\n\n\n\n<p><strong>When we disclose information.<\/strong><br>MINGLECITY does not use your personal information for purposes incompatible with those listed above. MINGLECITY does not sell, rent, or share your personal information to a third party unless you consent to provide such information to a third party partner or content service.<\/p>\n\n\n\n<p>In some cases, access to certain products and services, such as content subscription products or products distributed by third parties, may require the provision of personal information to a third party, such as a content provider or distributor.&nbsp; In such cases, this will be stated during the registration process, in the terms of use, through the distribution process, or in a similar manner. The third party’s use of such information is governed by that party’s privacy policy, and MINGLECITY’s use is governed by this privacy policy.&nbsp; Please visit the privacy policy of the content partner to make sure you understand how they use the personal information you provide to them.&nbsp; If you do not wish for such a transfer to take place, you should not register for the applicable product or service.&nbsp; Additionally, MINGLECITY may be required to provide specific access and usage information to certain content providers and rights holders as a condition of content licensing and royalties.&nbsp; In such cases, MINGLECITY may provide content usage, access, demographic and other information without your personally identifiable information (your name, billing information, email address) to the content provider.<\/p>\n\n\n\n<p>MINGLECITY may disclose relevant information about our customers to our contractors (e.g. a customer service contractor or a credit card clearing service) in order for them to provide specific services for MINGLECITY, and to better serve our customers. MINGLECITY’s contractors are bound by strict contractual requirements to keep all personal information they process strictly confidential and to use such information solely on behalf of MINGLECITY.<\/p>\n\n\n\n<p>Also, MINGLECITY may disclose your personal information if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on MINGLECITY; (b) protect and defend the rights or property of MINGLECITY and its products; or (c) act in urgent circumstances to protect the personal safety of users of MINGLECITY products or the public at large.<\/p>\n\n\n\n<p><strong>Links to other websites.<br><\/strong>MINGLECITY websites and products contain links to other websites and products.&nbsp; MINGLECITY is not responsible for the privacy practices or the content of such websites or products.&nbsp; Please visit the privacy policies of these third party sites in order to understand their privacy policies and data collection practices.&nbsp; MINGLECITY has no liability for these third party sites, their policies or actions.<\/p>\n\n\n\n<p><strong>Security of personal information.<br><\/strong>The security and confidentiality of your information is extremely important to us. We have implemented technical, administrative, and physical security measures to try to protect guest information from unauthorized access and improper use.&nbsp; From time to time, we review our security procedures in order to consider appropriate new technology and methods.<\/p>\n\n\n\n<p>MINGLECITY shall make all reasonable efforts to comply with this privacy policy; however, this policy should not be construed as a contractual undertaking and MINGLECITY cannot warrant the security of any information that you transmit to us.&nbsp; Please be aware that, despite our best efforts, no security measures are perfect or impenetrable and by transmitting personal information over the internet to us, you are accepting any risks associated with doing so.&nbsp; In addition, you are responsible for taking appropriate measures to protect and secure all passwords, log-on or membership identification information and account information.<\/p>\n\n\n\n<p><strong>Changes to this policy.<\/strong><br>We may revise this Privacy Policy to keep it up to date with MINGLECITY’s current policies, practices, products, services and web pages.&nbsp; MINGLECITY reserves the right to revise, change or modify this policy at any time for any reason.&nbsp; “Updated” may be used to alert users to recent changes and to the date of the last update. We also post FAQ’s from time to time on specific product.<\/p>\n\n\n\n<p><strong>Privacy questions.<br><\/strong>If you have questions or concerns about MINGLECITY’s Privacy Policy or data processing or use, please send an email to support@minglecity.com to contact us. We will respond to your inquiry within 30 days.<\/p>\n\n\n\n<p>Privacy Policy was last updated on April 2019 and is effective immediately.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Privacy Policy and Protection of Personal Information This site is owned by Mingle City LLC (“MINGLECITY”) and\/or its subsidiaries.&nbsp; MINGLECITY’s privacy policy covers the collection, use and dissemination of personal information that may be collected by MINGLECITY anytime you interact with MINGLECITY on one of its websites, such as when you listen to audio streams, &hellip;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":"","footnotes":""},"class_list":{"1":"page","2":"type-page","5":"entry"},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v26.8 - https:\/\/yoast.com\/product\/yoast-seo-wordpress\/ -->\n<title>Privacy Policy - Mingle City<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/minglecity.com\/privacy-policy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy - Mingle City\" \/>\n<meta property=\"og:description\" content=\"Privacy Policy and Protection of Personal Information This site is owned by Mingle City LLC (“MINGLECITY”) and\/or its subsidiaries.&nbsp; MINGLECITY’s privacy policy covers the collection, use and dissemination of personal information that may be collected by MINGLECITY anytime you interact with MINGLECITY on one of its websites, such as when you listen to audio streams, &hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/minglecity.com\/privacy-policy\/\" \/>\n<meta property=\"og:site_name\" content=\"Mingle City\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/minglecity.com\/privacy-policy\/\",\"url\":\"https:\/\/minglecity.com\/privacy-policy\/\",\"name\":\"Privacy Policy - Mingle City\",\"isPartOf\":{\"@id\":\"https:\/\/minglecity.com\/#website\"},\"datePublished\":\"2020-01-18T03:48:04+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/minglecity.com\/privacy-policy\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/minglecity.com\/privacy-policy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/minglecity.com\/privacy-policy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/minglecity.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Privacy Policy\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/minglecity.com\/#website\",\"url\":\"https:\/\/minglecity.com\/\",\"name\":\"Mingle City\",\"description\":\"Michael Baisden Live\",\"publisher\":{\"@id\":\"https:\/\/minglecity.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/minglecity.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/minglecity.com\/#organization\",\"name\":\"Mingle City\",\"url\":\"https:\/\/minglecity.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/minglecity.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/minglecity.com\/wp-content\/uploads\/2021\/11\/Mingle-City-NEW-Logo.png\",\"contentUrl\":\"https:\/\/minglecity.com\/wp-content\/uploads\/2021\/11\/Mingle-City-NEW-Logo.png\",\"width\":246,\"height\":66,\"caption\":\"Mingle City\"},\"image\":{\"@id\":\"https:\/\/minglecity.com\/#\/schema\/logo\/image\/\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Privacy Policy - Mingle City","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/minglecity.com\/privacy-policy\/","og_locale":"en_US","og_type":"article","og_title":"Privacy Policy - Mingle City","og_description":"Privacy Policy and Protection of Personal Information This site is owned by Mingle City LLC (“MINGLECITY”) and\/or its subsidiaries.&nbsp; MINGLECITY’s privacy policy covers the collection, use and dissemination of personal information that may be collected by MINGLECITY anytime you interact with MINGLECITY on one of its websites, such as when you listen to audio streams, &hellip;","og_url":"https:\/\/minglecity.com\/privacy-policy\/","og_site_name":"Mingle City","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/minglecity.com\/privacy-policy\/","url":"https:\/\/minglecity.com\/privacy-policy\/","name":"Privacy Policy - Mingle City","isPartOf":{"@id":"https:\/\/minglecity.com\/#website"},"datePublished":"2020-01-18T03:48:04+00:00","breadcrumb":{"@id":"https:\/\/minglecity.com\/privacy-policy\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/minglecity.com\/privacy-policy\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/minglecity.com\/privacy-policy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/minglecity.com\/"},{"@type":"ListItem","position":2,"name":"Privacy Policy"}]},{"@type":"WebSite","@id":"https:\/\/minglecity.com\/#website","url":"https:\/\/minglecity.com\/","name":"Mingle City","description":"Michael Baisden Live","publisher":{"@id":"https:\/\/minglecity.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/minglecity.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/minglecity.com\/#organization","name":"Mingle City","url":"https:\/\/minglecity.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/minglecity.com\/#\/schema\/logo\/image\/","url":"https:\/\/minglecity.com\/wp-content\/uploads\/2021\/11\/Mingle-City-NEW-Logo.png","contentUrl":"https:\/\/minglecity.com\/wp-content\/uploads\/2021\/11\/Mingle-City-NEW-Logo.png","width":246,"height":66,"caption":"Mingle City"},"image":{"@id":"https:\/\/minglecity.com\/#\/schema\/logo\/image\/"}}]}},"featured_image_src":null,"featured_image_src_square":null,"acf":[],"_links":{"self":[{"href":"https:\/\/minglecity.com\/wp-json\/wp\/v2\/pages\/1891","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/minglecity.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/minglecity.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/minglecity.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/minglecity.com\/wp-json\/wp\/v2\/comments?post=1891"}],"version-history":[{"count":0,"href":"https:\/\/minglecity.com\/wp-json\/wp\/v2\/pages\/1891\/revisions"}],"wp:attachment":[{"href":"https:\/\/minglecity.com\/wp-json\/wp\/v2\/media?parent=1891"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}